# Importing Libraries and Dataframes

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# Import dataframes
path = r"D:\0 - Data Analytics\4 - Python fundamentals for Data Analysts\Instacart Basket Analisys"
# vars_list = ['order_id', 'user_id', 'order_number', 'order_dow', 'order_hour_of_day', 'days_since_prior_order']
# df_ords = pd.read_csv(os.path.join(path, '02 - Data', 'Original Data', 'orders.csv'), usecols = vars_list)
df_ords = pd.read_csv(os.path.join(path, "02 Data", "Original Data", "orders.csv"))
df_prods = pd.read_csv(os.path.join(path, "02 Data", "Original Data", "products.csv"))
df_dep = pd.read_csv(os.path.join(path, "02 Data", "Original Data", "departments.csv"))

In [6]:
# df_ords.info()

# Data Wrangling Procedures

In [8]:
# Data wrangling =  term for conducting manipulations or transformations on data

- ## Dropping Columns

In [ ]:
# df.drop() -> then in the parentheses the argument
# df.drop(columns = ['variable'])
# df_ords.drop(columns = ['eval_set'])
# This only remove it visually, actual dataframe hasn't been changed.
# To overwrite dataframe and actually change it
df_ords = df_ords.drop(columns=["eval_set"])

- ### df.value_counts()

  df['variable'].value_counts(dropna = False)
  df = dataframe -> you perform the operation
  ['variable'] -> part of the database you want to perform the operation. This is a List of columns
  value_counts() -> the function
  dropna = False -> this ensure that the function doesn't drop missing values

  If you dont include 'dropna = False' the function will show the column existing values. This is called getting the frequency of a value.

  df['variable'] in Pandas is called a series. A series is a list within pandas
  This syntax 'df['variable']' is the standard way of accessing a column within a dataframe using pandas

In [ ]:
df_ords["days_since_prior_order"].value_counts(dropna=False)

days_since_prior_order
30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: count, dtype: int64

## Renaming Columns

- ### df.rename()

  df.rename(columns = {'old_name' : 'new_name'}, inplace = True) -> Syntax

  inpalce = true -> it overwrite the column, false would create a copy

In [ ]:
df_ords.rename(columns={"order_dow": "orders_day_of_week"}, inplace=True)
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

## Changing a Variable’s Data Type

- ### df.describe()
  When executing the describe() function, you can exclude these columns by changing their data type to something describe() will ignore, such as a string.
  df_ords['order_id'] = df_ords['order_id'].astype('str') -> This function changes the data type of the "order_id" column from a number to a string (which the describe() function will ignore when calculating descriptive statistics.
  astype() -> changes the datatype to whatever you give. in this case 'str' is for string.

In [ ]:
df_ords["order_id"] = df_ords["order_id"].astype("str")
df_ords["order_id"].dtype
# dtype() is different from dtypes(). Check the datatypes.

dtype('O')

## Transposing Data

Transposing refers to turning your dataframe’s rows into columns, and vice versa

In [20]:
# df_dep lready inported on top of the page
# df_dep.head() -> wide format. 1 rows, 22 columns

- ### df.T

In [ ]:
# Transposing df_dep
# df_dep.T
# Transpose and overwrite the dataframe into a new one
df_dep_t = df_dep.T

In [23]:
# df_dep
df_dep_t

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [24]:
# add an index to a dataframe that doesn't have it
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

- ## iloc[]

In [ ]:
# Create a new header for the dataframe
new_header = df_dep_t.iloc[0]
# copying the values within row 0 and assign it to a variable. Use []

In [27]:
new_header

0    department
Name: department_id, dtype: object

In [28]:
# Deleate the old header
# create a new dataframe that copy everything exept the first row
df_dep_t_new = df_dep_t[1:]
# 1: -> copy everything from the first row on.

In [29]:
# df_dep_t_new

In [30]:
# set the new_header variable as the ehader for df_dep_t_new
# tell python to use the  list of column in new_header as the new header for df_dep_t_new
df_dep_t_new.columns = new_header

In [31]:
# df_dep_t_new

# Data Dictionaries

- ## to_dict()

In [ ]:
# turn df_dep_t_new into a dictionary
data_dict = df_dep_t_new.to_dict("index")

In [35]:
# data_dict

# to_dict transformed the dataframe into a dictionary and saved into a variable.
# the argument 'index' tell Python to use the numbered rows as the key values for the enties in the dictionary.

In [36]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [ ]:
print(data_dict.get("19"))

{'department': 'snacks'}

# Subsetting

Subsetting = create smaller dataset from a whole data set based on a filter.

In [ ]:
# create a dataset for df_prod that contains only data from snack department.
df_snacks = df_prods[df_prods["department_id"] == 19]
# Within the brackets on the right-hand side, you’re telling Python to look into the
# df_prods dataframe and find a column called "department_id."
# And, within that "department_id" column, it should look for a value of 19

- ## object['element'] // Indexing
  retireve some elements from an object using the index operator []

In [ ]:
# searching for the data
# df_prods['department_id']==19

In [42]:
# map the true/false procedure you witnessed in the previous output onto the columns
# result only the true values
# df_prods[df_prods['department_id'] == 19]

In [ ]:
# save it into a new variable
df_prods_snacks = df_prods[df_prods["department_id"] == 19]

In [44]:
df_prods_snacks.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
15,16,Mint Chocolate Flavored Syrup,103,19,5.2
24,25,Salted Caramel Lean Protein & Fiber Bar,3,19,1.9
31,32,Nacho Cheese White Bean Chips,107,19,4.9
40,41,Organic Sourdough Einkorn Crackers Rosemary,78,19,6.5

- ## loc[]
  The loc function is similar to the iloc function you used previously, but while iloc looks for an integer position, loc looks for a column name.

In [ ]:
# look for instances where the value of "department_id" is 19 within the df_prods database:
df_snacks_2 = df_prods.loc[df_prods["department_id"] == 19]
# rather than using a equal sign here we use isin() to look into a list.
# we can put multiple values in isin(). Example: isin([17,18,19])
df_snacks_3 = df_prods.loc[df_prods["department_id"].isin([19])]

# Exporting Dataframes

The export command takes the following syntax:

df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

# Task 4.4

## 2

Find another identifier variable in the df_ords dataframe that doesn’t need to be included in your analysis as a numeric variable.
Change it to a suitable format.

In [50]:
df_ords.dtypes

order_id                   object
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [ ]:
# Change user_id to string
df_ords["user_id"] = df_ords["user_id"].astype(str)
df_ords["user_id"].dtype

dtype('O')

In [ ]:
# Change also order_number into a string for the same reason
df_ords["order_number"] = df_ords["order_number"].astype(str)
df_ords.describe()

       orders_day_of_week  order_hour_of_day  days_since_prior_order
count        3.421083e+06       3.421083e+06            3.214874e+06
mean         2.776219e+00       1.345202e+01            1.111484e+01
std          2.046829e+00       4.226088e+00            9.206737e+00
min          0.000000e+00       0.000000e+00            0.000000e+00
25%          1.000000e+00       1.000000e+01            4.000000e+00
50%          3.000000e+00       1.300000e+01            7.000000e+00
75%          5.000000e+00       1.600000e+01            1.500000e+01
max          6.000000e+00       2.300000e+01            3.000000e+01

## 3

Look for a variable in your df_ords dataframe with an unintuitive name and change its name without overwriting the dataframe.

In [ ]:
# All the names are quite understandble the only one that could be written a bit better is 'days_since_prior_order'
# 'days_since_prior_order' renamed to 'days_since_last_order'
# Since the task specify to not overwrite the dataframe i will save it in 'df_ords_renamed'
df_ords_renamed = df_ords.rename(
    columns={"days_since_prior_order": "days_since_last_order"}
)
df_ords_renamed.dtypes

order_id                  object
user_id                   object
order_number              object
orders_day_of_week         int64
order_hour_of_day          int64
days_since_last_order    float64
dtype: object

## 4

Your client wants to know what the busiest hour is for placing orders. Find the frequency of the corresponding variable and share your findings.

In [ ]:
# find frequency using value_counts(dropna = False)
df_ords["order_hour_of_day"].value_counts(dropna=False)

order_hour_of_day
10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: count, dtype: int64

The busiest hour for placing orders is at 10. the timeframe between 8 and 18 is trhe busiest.

## 5

Determine the meaning behind a value of 4 in the "department_id" column within the df_prods dataframe using a data dictionary.

In [ ]:
# Print the department '4' from data dictionary
print(data_dict.get("4"))

{'department': 'produce'}

## 6

The sales team in your client’s organization wants to know more about breakfast item sales. Create a subset containing only the required information.

In [61]:
# get the department number of breakfast department.
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

In [ ]:
# breakfast is number 14
df_prods_breakfast = df_prods.loc[df_prods["department_id"] == 14]

In [ ]:
# check the breakfast dataframe
df_prods_breakfast.head()

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6

## 7

They’d also like to see details about products that customers might use to throw dinner parties. Your task is to find all observations from the entire dataframe that include items from the following departments: alcohol, deli, beverages, and meat/seafood. You’ll need to present this subset to your client.

In [ ]:
# create new dataframe using the isin() function. The department that i need are: 5,7,12,20
df_prods_dinner_party = df_prods.loc[df_prods["department_id"].isin([5, 7, 12, 20])]

In [66]:
# check it
df_prods_dinner_party.head()

,product_id,product_name,aisle_id,department_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
6,7,Pure Coconut Water With Orange,98,7,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4
10,11,Peach Mango Juice,31,7,2.8
16,17,Rendered Duck Fat,35,12,17.1

## 8

It’s important that you keep track of total counts in your dataframes. How many rows does the last dataframe you created have?

In [68]:
# use shape to get rowns and columns
df_prods_dinner_party.shape

(7650, 5)

In [69]:
# there are 7650 rows

## 9

Someone from the data engineers team in Instacart thinks they’ve spotted something strange about the customer with a "user_id" of “1.” Extract all the information you can about this user.

In [ ]:
# save the data of user_id = 1 in the variable investigated_customer

# investigated_customer = df_ords.loc[df_ords['user_id'] == 1]
# investigated_customer = df_ords[df_ords['user_id'] == 1]
investigated_customer = df_ords_renamed[df_ords_renamed["user_id"] == "1"]

In [72]:
# check it
investigated_customer

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
5,3367565,1,6,2,7,19.0
6,550135,1,7,1,9,20.0
7,3108588,1,8,1,14,14.0
8,2295261,1,9,1,16,0.0
9,2550362,1,10,4,8,30.0
10,1187899,1,11,4,8,14.0

## 10

You also need to provide some details about this user’s behavior. What basic stats can you provide based on the information you have?

In [74]:
investigated_customer.describe()

       orders_day_of_week  order_hour_of_day  days_since_last_order
count           11.000000          11.000000              10.000000
mean             2.636364          10.090909              19.000000
std              1.286291           3.477198               9.030811
min              1.000000           7.000000               0.000000
25%              1.500000           7.500000              14.250000
50%              3.000000           8.000000              19.500000
75%              4.000000          13.000000              26.250000
max              4.000000          16.000000              30.000000

This user has palced 11 orders, he places orders only the first 4 days of the week so if we consider Sunday as the first day he palces orders in between Sunday and Wednesday. The averge time in between orders is 19 days. The average of orders were made at 10AM.
The minimum amount of time that he spent without making an order is 0 so this suggest that he ordered 2 times in a day.
The maximimum amount of time that he spent without making an order was 30 days.

## 11

Check the organization and structure of your notebook. Be sure to include section headings and code comments.

## 12

Export your df_ords dataframe as “orders_wrangled.csv” in your “Prepared Data” folder.

In [ ]:
# Export order_wrangled
# df_ords.to_csv(os.path.join(path, '02 Data', 'Prepared data', 'orders_wrangled.csv'), index=False)
# Export also order_renamed
df_ords_renamed.to_csv(
    os.path.join(path, "02 Data", "Prepared data", "orders_renamed_wrangled.csv"),
    index=False,
)

## 13

Export the df_dep_t_new dataframe as “departments_wrangled.csv” in your “Prepared Data” folder so that you have a “.csv” file of your departments data in the correct format.

In [ ]:
# Export department_wrangled
df_dep_t_new.to_csv(
    os.path.join(path, "02 Data", "Prepared data", "department_wrangled.csv")
)

In [158]:
df_ords_renamed.describe()

       orders_day_of_week  order_hour_of_day  days_since_last_order
count        3.421083e+06       3.421083e+06           3.214874e+06
mean         2.776219e+00       1.345202e+01           1.111484e+01
std          2.046829e+00       4.226088e+00           9.206737e+00
min          0.000000e+00       0.000000e+00           0.000000e+00
25%          1.000000e+00       1.000000e+01           4.000000e+00
50%          3.000000e+00       1.300000e+01           7.000000e+00
75%          5.000000e+00       1.600000e+01           1.500000e+01
max          6.000000e+00       2.300000e+01           3.000000e+01